{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите число a: 57489786\n",
      "Максимальная цифра в числе a: [9]\n"
     ]
    }
   ],
   "source": [
    "# Задача-1: Дано произвольное целое число, вывести самую большую цифру этого числа.\n",
    "# Например, дается x = 58375.\n",
    "# Нужно вывести максимальную цифру в данном числе, т.е. 8.\n",
    "# Подразумевается, что мы не знаем это число заранее.\n",
    "# Число приходит в виде целого беззнакового.\n",
    "# Подсказки:\n",
    "# * постарайтесь решить задачу с применением арифметики и цикла while;\n",
    "# * при желании и понимании решите задачу с применением цикла for.\n",
    "\n",
    "a = int(input('Введите число a: '))\n",
    "b = []\n",
    "\n",
    "while a > 10:\n",
    "    b.append(a % 10)\n",
    "    a = int(a / 10)\n",
    "\n",
    "b.append(a)\n",
    "\n",
    "while len(b) > 1:\n",
    "    if b[0] >= b[1]:\n",
    "        b.remove(b[1])\n",
    "    else:\n",
    "        b.remove(b[0])\n",
    "\n",
    "print('Максимальная цифра в числе a: ' + str(b))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите число a: 123456\n",
      "Максимальная цифра в числе a: 6\n"
     ]
    }
   ],
   "source": [
    "# Вариант 2 для Задачи-1:\n",
    "\n",
    "a = input('Введите число a: ')\n",
    "b = list(a)\n",
    "c = max(b)\n",
    "\n",
    "print('Максимальная цифра в числе a: ' + str(c))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите число a: 4\n",
      "Введите число b: 6\n",
      "Число a = 6\n",
      "Число b = 4\n"
     ]
    }
   ],
   "source": [
    "# Задача-2: Исходные значения двух переменных запросить у пользователя.\n",
    "# Поменять значения переменных местами. Вывести новые значения на экран.\n",
    "# Решите задачу, используя только две переменные.\n",
    "# Подсказки:\n",
    "# * постарайтесь сделать решение через действия над числами;\n",
    "# * при желании и понимании воспользуйтесь синтаксисом кортежей Python.\n",
    "\n",
    "a = int(input('Введите число a: '))\n",
    "b = int(input('Введите число b: '))\n",
    "\n",
    "a = a + b    \n",
    "b = a - b    \n",
    "a = a - b\n",
    "\n",
    "print('Число a = ' + str(a))\n",
    "print('Число b = ' + str(b))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Дано квадратное уравнение вида: ax² + bx + c = 0.\n",
      "Введите коэффициент уравнения a: 1\n",
      "Введите коэффициент уравнения b: 4\n",
      "Введите коэффициент уравнения c: 2\n",
      "Дискриминант уравнения равен 8\n",
      "Уравнение имеет два корня: -3.4 и -0.6\n"
     ]
    }
   ],
   "source": [
    "# Задача-3: Напишите программу, вычисляющую корни квадратного уравнения вида\n",
    "# ax² + bx + c = 0.\n",
    "# Коэффициенты уравнения вводятся пользователем.\n",
    "# Для вычисления квадратного корня воспользуйтесь функцией sqrt() модуля math:\n",
    "# import math\n",
    "# math.sqrt(4) - вычисляет корень числа 4\n",
    "\n",
    "import math\n",
    "\n",
    "print('Дано квадратное уравнение вида: ax² + bx + c = 0.')\n",
    "a = int(input('Введите коэффициент уравнения a: '))\n",
    "b = int(input('Введите коэффициент уравнения b: '))\n",
    "c = int(input('Введите коэффициент уравнения c: '))\n",
    "\n",
    "D = b ** 2 - 4 * a * c\n",
    "\n",
    "print('Дискриминант уравнения равен ' + str(D))\n",
    "\n",
    "if D > 0:\n",
    "    x1 = (-b - math.sqrt(D)) / 2 * a\n",
    "    x1 = round(x1, 1)\n",
    "    x2 = (-b + math.sqrt(D)) / 2 * a\n",
    "    x2 = round(x2, 1)\n",
    "    print('Уравнение имеет два корня: ' + str(x1) + ' и ' + str(x2))\n",
    "elif D == 0:\n",
    "    x = -b / 2 * a\n",
    "    round(x, 1)\n",
    "    print('Уравнение имеет только один корень: ' + str(x))\n",
    "else:\n",
    "    print('Уравнение не имеет корней')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Дано квадратное уравнение вида: ax² + bx + c = 0.\n",
      "Введите коэффициент уравнения a: 1\n",
      "Введите коэффициент уравнения b: 4\n",
      "Введите коэффициент уравнения c: 2\n",
      "Дискриминант уравнения равен 8\n",
      "Уравнение имеет два корня: -3.4 и -0.6\n"
     ]
    }
   ],
   "source": [
    "# Вариант Задачи-3 без import math\n",
    "\n",
    "print('Дано квадратное уравнение вида: ax² + bx + c = 0.')\n",
    "a = int(input('Введите коэффициент уравнения a: '))\n",
    "b = int(input('Введите коэффициент уравнения b: '))\n",
    "c = int(input('Введите коэффициент уравнения c: '))\n",
    "\n",
    "D = b ** 2 - 4 * a * c\n",
    "\n",
    "print('Дискриминант уравнения равен ' + str(D))\n",
    "\n",
    "if D > 0:\n",
    "    x1 = (-b - D ** 0.5) / 2 * a\n",
    "    x1 = round(x1, 1)\n",
    "    x2 = (-b + D ** 0.5) / 2 * a\n",
    "    x2 = round(x2, 1)\n",
    "    print('Уравнение имеет два корня: ' + str(x1) + ' и ' + str(x2))\n",
    "elif D == 0:\n",
    "    x = -b / 2 * a\n",
    "    round(x, 1)\n",
    "    print('Уравнение имеет только один корень: ' + str(x))\n",
    "else:\n",
    "    print('Уравнение не имеет корней')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
